SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( Ruston88DS

Type ( Engine )
WagonShape ( 88DS.s )
Size ( 2.39m 3.37m 6.95m )  
Mass ( 17t-uk )

Coupling (
		Type ( Chain )
		Spring (
        	Stiffness ( 1e6N/m 5e6N/m )
        	Damping ( 1e6N/m/s 1e6N/m/s )
		Break ( 600kN 1000kN )
        	r0 ( 0cm 0cm )
		    )
		comment( CouplingHasRigidConnection () )
		Velocity ( 0.1m/s )
	   )

BrakeEquipmentType ( Vacuum_brake, Auxilary_reservoir, Handbrake )
BrakeSystemType ( Vacuum_single_pipe )
MaxBrakeForce ( 46kN )
MaxHandbrakeForce ( 17kN )
BrakeCylinderPressureForMaxBrakeBrakeForce ( 21inHg )
BrakePipeVolume ( 0.65ft^3 )
ORTSNumberBrakeCylinders ( 2 )
ORTSBrakeCylinderSize ( 18in )
MaxReleaseRate ( 10 )Comment (doesn't seem to do anything)
MaxApplicationRate ( 10 )Comment (doesn't seem to do anything)


ORTSBearingType ( Friction ) 

Comment(CTN 1990 Resistance Freight Loco)
    ORTSDavis_A ( 287.0 )
    ORTSDavis_B ( 5.7 )
    ORTSDavis_C ( 2.94 )
    ORTSWagonFrontalArea (55ft^2)
    ORTSDavisDragConstant ( 0.0024 )

    CentreOfGravity ( 0ft 6.0ft 0ft )
    ORTSTrackGauge ( 4ft 8.5in )
    ORTSRigidWheelbase ( 9ft 0.0in )
    ORTSUnbalancedSuperelevation ( 6in )

Comment(***Lights***)

Lights ( 3

Light (
   comment( Sphere of light-Beam )
   Type  ( 1 )
   Conditions (
    Headlight ( 4 )
    Unit ( 2 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffffffcc )
     Position ( 0 2.797 3.115 )
     Azimuth ( 0 -5.0 5.0 )
     Transition ( 0.8 )
     Radius (100 )
     Angle ( 15 )
     )
    )
   )

  Light (
   comment( Front Beam )
   Type  ( 0 )
   Conditions (
    Headlight ( 4 )
    Unit ( 2 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffffffcc )
     Position ( 0 2.797 3.115 )
     Azimuth ( 0 -5.0 5.0 )
     Transition ( 0.8 )
     Radius ( 0.4 )
     )
    )
   )
 Light (
   comment( Rear Beam )
   Type  ( 0 )
   Conditions (
    Headlight ( 4 )
    Unit ( 5 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffffffcc )
     Position ( 0 2.797 -3.115 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0.8 )
     Radius ( 0.4 )
     )
    )
   )
  )
 
Comment ( **** Freight and Load Animations*** )  

Comment ( ******** Miscellaneous Information************** ) 
IntakePoint ( 3.33 1.4 FuelDiesel )
Sound ( "..\\..\\common.MEP\\MEP-Class07Sound\\MEP-07eng01.sms" )
)


Engine ( Ruston88DS 

 Effects (
  DieselSpecialEffects
  (
   Exhaust1
   (
    -0.2 3.75 -1.1
    0 1 0
    .05
   )
  )
 )

Wagon ( Ruston88DS )
Comment ( *** General Information *** )
WheelRadius ( 18in )
Sanding ( 25mph )
NumWheels ( 2 )
ORTSDriveWheelWeight ( 17t-uk )

Comment ( *** Diesel Prime Mover (Engine) *** )
Type ( Diesel )
ORTSDieselEngineMaxPower ( 88hp )
MaxDieselLevel( 40g-uk )
MaxTemperature ( 120degF )
MaxOilPressure ( 90 )
DieselUsedPerHourAtMaxPower ( 8g-uk )
DieselUsedPerHourAtIdle ( 1g-uk )
DieselEngineIdleRPM( 100 )
DieselEngineMaxRPM( 650 )
DieselEngineMaxRPMChangeRate( 40 )

Comment ( *** Diesel Engine - Exhaust Effects *** )
DieselSmokeEffectInitialMagnitude(0 ) 
DieselSmokeEffectMaxMagnitude( 0 ) 
DieselSmokeEffectInitialSmokeRate( 0 ) 
DieselSmokeEffectMaxSmokeRate( 1 )   

Comment ( *** Traction Motor *** )
DieselEngineType ( hydraulic )

MaxPower ( 66hp )Comment(88 x 75%)
MaxForce ( 9900lb )
Comment(MaxContinuousForce ( xxxxxlb ))
Comment(ORTSSpeedOfMaxContinuousForce ( 18mph ))
MaxVelocity ( 20mph )

Comment ( ****** Gearing, Gear type, ratio, etc **** )	

GearBoxNumberOfGears( 3 )
GearBoxDirectDriveGear( 3 )
GearBoxMaxSpeedForGears( 5 15 20 )
GearBoxMaxTractiveForceForGears( 44kN 22kN 12kN )
Comment(Max TE = 15650lbf = 69kN) 
Comment(GearBoxOverspeedPercentageForFailure( 170 ))
GearBoxBackLoadForce( 4500 )
GearBoxCoastingForce( 2000 )
GearBoxUpGearProportion( 0.85 )
GearBoxDownGearProportion( 0.35 )
GearBoxOperation( manual )
GearBoxEngineBraking( direct_drive )


Comment (*** Braking system ***)
BrakesEngineBrakeType( Vacuum_single_pipe )
BrakesTrainBrakeType( Vacuum_single_pipe )

Comment (*** Exhausters ***)
Comment (* Electrical exhausters - creating rate 220 cfm // estimate maintaining rate equivalent to 40 cfm @ train pipe *)

Comment(ORTSBrakePipeChargingRate ( 0.55InHg/s )) Comment (* creating rate for RELEASE only *)
Comment (* xxxxxxxxxxORTSBrakePipeChargingRate = 0.11 for RUNNING/SERVICE - maintaining rate *)

Comment (*** Brake Valve ***)
TrainBrakesControllerMaxSystemPressure ( 21 )
TrainBrakesControllerMinPressureReduction ( 2inHg )
EngineBrakesControllerHasProportionalBrake ( 1 )
Comment(EngineBrakesProportionalBrakeLag ( 0.5 )) Comment (* Loco air brake controlled by train pipe vacuum *)


Comment ( ********************* Locomotive Monitoring Systems (If used) *********************
          Included in this section - Monitoring of Overspeed, Emergency Braking, Vigilance, etc
          *********************************************************************************** )


Comment ( ********************************* Engine Controls *********************************
              Included in this section - Controllers for Regulator, Reverser, Brakes, etc
          *********************************************************************************** ) 
           
 EngineControllers (
            Throttle ( 0 10 0.1 0 
            NumNotches ( 5 
                	Notch ( 0    0 Dummy )
             	Notch ( 1.5  0 Dummy )
   			Notch ( 5    0 Dummy )
                	Notch ( 7    0 Dummy )
                	Notch ( 10   0 Dummy )
                )
            )
       
            Brake_Train ( 0 1 0.05 0.2
                NumNotches ( 3
                    Notch ( 0.1  0 TrainBrakesControllerReleaseStart )
                    Notch ( 0.2  1 TrainBrakesControllerVacuumContinuousServiceStart )
                    Notch ( 0.9  0 TrainBrakesControllerEmergencyStart )
                    )
                  )
            
            DirControl ( -1 0 1 1 )
            BellToggle( 0 1 0 )
            Sanding ( 0 1 0 )
            Horn ( 0 1 0 )
            Wipers ( 0 1 0 )
            Headlights ( 0 0.25 1 0 )
            BailOffButton( 0 1 0 )
  		 Gear( 0 3 1 0
                NumNotches ( 4
                 Notch ( 0         0 Dummy )
                 Notch ( 1         0 Dummy )
                 Notch ( 2         0 Dummy )
                 Notch ( 3         0 Dummy )
                        )
                 )

        )

Comment ( ****** Miscellaneous Information Included in this section - Alternate Views, Sounds***** )

DoesHornTriggerBell( 1 )

ORTSExternalSoundPassedThroughPercent ( 50 )          
Sound ( "..\\..\\common.MEP\\MEP-Class07Sound\\MEP-07cab01.sms" )
CabView ( 88DS.cvf )
HeadOut ( -1.5 2.87 -1.954 ) 
Name ( "Ruston 88DS, Semi-Basic Physics" )

Description (
  "The Ruston & Hornsby Class 88DS (88hp Diesel Shunter)      "+
 "254 of these little engines were built by Ruston & Hornsby "+
 "at their Lincoln Works between 1942 and 1967.              "+
 "\nSPECIFICATIONS :                                         "+
 "\nPower: 88 HP at 1000rpm\nMax. speed: 15mph    \nPower sou"+
 "rce:4 Cylinder Ruston 4VPHL Engine\nMax. continuous tractiv"+
 "e effort: about 6000lbf      \nWheel configuration: Four 36"+
 "in. diameter        \nWeight: 17 tons (metric)    \nFuel Ca"+
 "pacity:  40gal\nTotal Built: 254\nModel copyright(c) Andy D"+
 "unnett 2003\nVersion 1.0. Provided as freeware."
)
)
